### loc and iloc :

#### LOC

#### Access a group of rows or columns by label(s) or bolean array.

In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("C:\\Users\\nikhil\\Desktop\\datasets\\export.csv")

In [3]:
df

,ID,NAME,COMPANIES,INCEPTION,REVENUE,EXPENSES,PROFIT,GROWTH
0,1,leonardo,IT,2009,"$10,234,567","6,678,456 Dollars",5647547,30
1,2,orlando,HEALTH,2019,"$9,234967","6,638,456 Dollars",5647547,25
2,3,finn,IT,2010,"$12,238,200","6,673456 Dollars",5647547,25
3,4,philander,FINANCE,2009,"$23,264,109","5,678,456 Dollars",93483,0
4,5,jacob,FINANCE,2008,"$5,212,989","4,678,456 Dollars",34266,20
5,6,mania,FINANCE,2016,$7345567,6788 Dollars,7923,23
6,7,larry,HEALTH,2015,$3455,4521 dollars,0,9
7,8,alexander,GOVT,2017,"$1389,567",38929 dollars,43222,25
8,9,harry,IT,2017,"$176,567",238282 dollars,7767,36
9,10,milano,FINANCE,2016,$9542007,38888 dollars,12867,22

In [4]:
df.loc[0]

ID                           1
NAME                  leonardo
COMPANIES                   IT
INCEPTION                 2009
REVENUE            $10,234,567
EXPENSES     6,678,456 Dollars
PROFIT                 5647547
GROWTH                      30
Name: 0, dtype: object

In [5]:
df.loc[[0]]

,ID,NAME,COMPANIES,INCEPTION,REVENUE,EXPENSES,PROFIT,GROWTH
0,1,leonardo,IT,2009,"$10,234,567","6,678,456 Dollars",5647547,30

In [6]:
df.loc[1]

ID                           2
NAME                   orlando
COMPANIES               HEALTH
INCEPTION                 2019
REVENUE              $9,234967
EXPENSES     6,638,456 Dollars
PROFIT                 5647547
GROWTH                      25
Name: 1, dtype: object

In [7]:
df.loc[0:3]

,ID,NAME,COMPANIES,INCEPTION,REVENUE,EXPENSES,PROFIT,GROWTH
0,1,leonardo,IT,2009,"$10,234,567","6,678,456 Dollars",5647547,30
1,2,orlando,HEALTH,2019,"$9,234967","6,638,456 Dollars",5647547,25
2,3,finn,IT,2010,"$12,238,200","6,673456 Dollars",5647547,25
3,4,philander,FINANCE,2009,"$23,264,109","5,678,456 Dollars",93483,0

In [8]:
df.loc[[2,4,5]]

,ID,NAME,COMPANIES,INCEPTION,REVENUE,EXPENSES,PROFIT,GROWTH
2,3,finn,IT,2010,"$12,238,200","6,673456 Dollars",5647547,25
4,5,jacob,FINANCE,2008,"$5,212,989","4,678,456 Dollars",34266,20
5,6,mania,FINANCE,2016,$7345567,6788 Dollars,7923,23

In [9]:
df.loc[2,'COMPANIES']

'IT'

In [10]:
df.loc[[2,3,4],"COMPANIES"]

2         IT
3    FINANCE
4    FINANCE
Name: COMPANIES, dtype: object

In [11]:
df.loc[[2,3,4,5],["COMPANIES","GROWTH"]]

  COMPANIES  GROWTH
2        IT      25
3   FINANCE       0
4   FINANCE      20
5   FINANCE      23

#### SLICING

In [12]:
df.loc[2:6,"COMPANIES"]

2         IT
3    FINANCE
4    FINANCE
5    FINANCE
6     HEALTH
Name: COMPANIES, dtype: object

In [13]:
df.loc[2:4,["COMPANIES"]]

  COMPANIES
2        IT
3   FINANCE
4   FINANCE

In [14]:
df.loc[2:4,["COMPANIES","GROWTH","REVENUE"]]

  COMPANIES  GROWTH      REVENUE
2        IT      25  $12,238,200
3   FINANCE       0  $23,264,109
4   FINANCE      20   $5,212,989

In [15]:
##Passing boolean array

df.loc[[False,True]]

,ID,NAME,COMPANIES,INCEPTION,REVENUE,EXPENSES,PROFIT,GROWTH
1,2,orlando,HEALTH,2019,"$9,234967","6,638,456 Dollars",5647547,25

In [16]:
df.loc[[True,False,True,False,True],["ID","COMPANIES","GROWTH"]]

   ID COMPANIES  GROWTH
0   1        IT      30
2   3        IT      25
4   5   FINANCE      20

In [17]:
df.loc[[True,False],"ID":"INCEPTION"]

   ID      NAME COMPANIES  INCEPTION
0   1  leonardo        IT       2009

#### CONDITIONAL OPERATOR IN LOC:

In [18]:
df.loc[df['ID']>6]

,ID,NAME,COMPANIES,INCEPTION,REVENUE,EXPENSES,PROFIT,GROWTH
6,7,larry,HEALTH,2015,$3455,4521 dollars,0,9
7,8,alexander,GOVT,2017,"$1389,567",38929 dollars,43222,25
8,9,harry,IT,2017,"$176,567",238282 dollars,7767,36
9,10,milano,FINANCE,2016,$9542007,38888 dollars,12867,22

In [19]:
df.loc[df['GROWTH']>30]

   ID   NAME COMPANIES  INCEPTION   REVENUE        EXPENSES  PROFIT  GROWTH
8   9  harry        IT       2017  $176,567  238282 dollars    7767      36

In [20]:
df.loc[df['GROWTH']>20,["ID","GROWTH","NAME","COMPANIES"]]

   ID  GROWTH       NAME COMPANIES
0   1      30   leonardo        IT
1   2      25    orlando    HEALTH
2   3      25       finn        IT
5   6      23      mania   FINANCE
7   8      25  alexander      GOVT
8   9      36      harry        IT
9  10      22     milano   FINANCE

## ILOC

### integer location based indexing

In [21]:
df.iloc[0]

ID                           1
NAME                  leonardo
COMPANIES                   IT
INCEPTION                 2009
REVENUE            $10,234,567
EXPENSES     6,678,456 Dollars
PROFIT                 5647547
GROWTH                      30
Name: 0, dtype: object

In [22]:
df.iloc[[0]]

,ID,NAME,COMPANIES,INCEPTION,REVENUE,EXPENSES,PROFIT,GROWTH
0,1,leonardo,IT,2009,"$10,234,567","6,678,456 Dollars",5647547,30

In [23]:
df.iloc[0,1]

'leonardo'

In [24]:
df.iloc[0:4,1:3]

        NAME COMPANIES
0   leonardo        IT
1    orlando    HEALTH
2       finn        IT
3  philander   FINANCE

In [25]:
df.iloc[[0,4],[1,3]]

       NAME  INCEPTION
0  leonardo       2009
4     jacob       2008

In [26]:
df.iloc[[True,False,True,True]]

,ID,NAME,COMPANIES,INCEPTION,REVENUE,EXPENSES,PROFIT,GROWTH
0,1,leonardo,IT,2009,"$10,234,567","6,678,456 Dollars",5647547,30
2,3,finn,IT,2010,"$12,238,200","6,673456 Dollars",5647547,25
3,4,philander,FINANCE,2009,"$23,264,109","5,678,456 Dollars",93483,0

In [27]:
df.iloc[[True,False,True,True],0:3]

   ID       NAME COMPANIES
0   1   leonardo        IT
2   3       finn        IT
3   4  philander   FINANCE

In [28]:
df.iloc[[True,False,True,True],[0,3]]

   ID  INCEPTION
0   1       2009
2   3       2010
3   4       2009

In [29]:
df.iloc[[True,False,True,True],[0,1,2,3]]

   ID       NAME COMPANIES  INCEPTION
0   1   leonardo        IT       2009
2   3       finn        IT       2010
3   4  philander   FINANCE       2009